Safe_REST_API/src/Catalogs/кв_ШаблоныСервисов/кв_ШаблоныСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кв_ШаблоныСервисов</name>
  <owners>Catalog.кв_Сервисы</owners>
  <tabularSections>
    <name>Методы</name>
    <attributes>
      <name>HTTPМетод</name>
      <type>
        <types>EnumRef.кв_HTTPМетоды</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЛогирования</name>
      <type>
        <types>EnumRef.кв_СпособыЛогирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ОчищатьОтветВЛоге</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Safe_REST_API/src/Catalogs/кв_ШаблоныСервисов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает шаблоны по переданныму сервису.
// Из метаданных определяются шаблоны и методы сервиса, создаются элементы справочника "Шаблоны сервиса".
//
// Параметры:
//  Сервис - СправочникСсылка.кв_Сервисы - сервис-владелец шаблона.
//
Процедура СоздатьШаблоныПоСервису(Сервис) Экспорт
	
	Если Не ЗначениеЗаполнено(Сервис) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	кв_Сервисы.Наименование КАК Наименование,
	|	кв_Сервисы.ПометкаУдаления КАК ПометкаУдаления,
	|	кв_Сервисы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.кв_Сервисы КАК кв_Сервисы
	|ГДЕ
	|	кв_Сервисы.Ссылка = &Сервис";
	Запрос.УстановитьПараметр("Сервис", Сервис);
	
	ПараметрыСервиса = Новый Структура("Наименование, ПометкаУдаления, Ссылка");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыСервиса, Выборка);
	КонецЕсли;
		
	Если ПараметрыСервиса.ПометкаУдаления = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ШаблоныСозданные = ШаблоныПоСервисуИзСправочника(ПараметрыСервиса);
	
	ШаблоныИзМетаданных = ШаблоныПоСервисуИзМетаданных(ПараметрыСервиса);
	
	Если ШаблоныИзМетаданных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СпособЛогированияПоУмолчанию = Перечисления.кв_СпособыЛогирования.СпособЛогированияПоУмолчанию();
	
	Для Каждого ШаблонИзМетаданных Из ШаблоныИзМетаданных Цикл
		
		ШаблонСсылка = Неопределено;
		МетодыСозданные = Новый Массив;
		
		Если Не ШаблоныСозданные = Неопределено Тогда
			
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("Наименование", ШаблонИзМетаданных.Ключ);
			
			НайденныеШаблоны = ШаблоныСозданные.НайтиСтроки(ПараметрыПоиска);
			
			Если НайденныеШаблоны.Количество() > 0 Тогда
				ШаблонСсылка = НайденныеШаблоны[0].Ссылка;
				
				Для Каждого СтрокаМетода Из НайденныеШаблоны Цикл
					МетодыСозданные.Добавить(СтрокаМетода.HTTPМетод);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НовыеМетоды = кв_ОбщегоНазначенияКлиентСервер.РазностьМассивов(ШаблонИзМетаданных.Значение, МетодыСозданные);
		
		Если НовыеМетоды.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
		Иначе
			ШаблонОбъект = Справочники.кв_ШаблоныСервисов.СоздатьЭлемент();
		КонецЕсли;
		
		ШаблонОбъект.Владелец = Сервис;
		
		НаименованиеШаблона = ШаблонИзМетаданных.Ключ;
		кв_ОбщегоНазначенияКлиентСервер.ОтформатироватьНаименованиеШаблонаСервиса(НаименованиеШаблона);
		
		ШаблонОбъект.Наименование = НаименованиеШаблона;
		
		Для Каждого Метод Из НовыеМетоды Цикл
			НоваяСтрокаМетода = ШаблонОбъект.Методы.Добавить();
			НоваяСтрокаМетода.HTTPМетод = Метод;
			НоваяСтрокаМетода.СпособЛогирования = СпособЛогированияПоУмолчанию;
		КонецЦикла;
		
		ШаблонОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает данные (настройки логирования) шаблона сервисов.
//
// Параметры:
//  Сервис              - СправочникСсылка.кв_Сервисы - сервис-владелец шаблона.
//  НаименованиеШаблона - Строка - наименование шаблона.
//  HTTPМетод           - ПеречислениеСсылка.кв_HTTPМетоды - метод.
// 
// Возвращаемое значение:
//  Результат - Структура - структура с данными шаблона сервиса.
//
Функция ДанныеШаблонаСервисов(Сервис, НаименованиеШаблона, HTTPМетод) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Шаблон", Справочники.кв_ШаблоныСервисов.ПустаяСсылка());
	Результат.Вставить("HTTPМетод", Перечисления.кв_HTTPМетоды.ПустаяСсылка());
	Результат.Вставить("СпособЛогирования", Перечисления.кв_СпособыЛогирования.ПустаяСсылка());
	Результат.Вставить("ОчищатьОтветВЛоге", Ложь);
	
	Если Не ЗначениеЗаполнено(Сервис)
		Или Не ЗначениеЗаполнено(НаименованиеШаблона)
		Или Не ЗначениеЗаполнено(HTTPМетод) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Настройки метода отбираются по приоритету:
	// - есть настройка по указанному в параметрах методу,
	// - настройка с пустым методом: предполагается, что для шаблона в метаданных
	//   задан метод с типом Любой, тогда будет обработан любой HTTP-методе
	//   (см. пример estimatesAPI /start_approval/*).
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	кв_ШаблоныСервисовМетоды.Ссылка КАК Шаблон,
	|	кв_ШаблоныСервисовМетоды.HTTPМетод КАК HTTPМетод,
	|	кв_ШаблоныСервисовМетоды.СпособЛогирования КАК СпособЛогирования,
	|	кв_ШаблоныСервисовМетоды.ОчищатьОтветВЛоге КАК ОчищатьОтветВЛоге
	|ПОМЕСТИТЬ втМетоды
	|ИЗ
	|	Справочник.кв_ШаблоныСервисов.Методы КАК кв_ШаблоныСервисовМетоды
	|ГДЕ
	|	кв_ШаблоныСервисовМетоды.Ссылка.Владелец = &Сервис
	|	И кв_ШаблоныСервисовМетоды.Ссылка.Наименование = &НаименованиеШаблона
	|	И НЕ кв_ШаблоныСервисовМетоды.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втМетоды.Шаблон КАК Шаблон,
	|	втМетоды.HTTPМетод КАК HTTPМетод,
	|	втМетоды.СпособЛогирования КАК СпособЛогирования,
	|	втМетоды.ОчищатьОтветВЛоге КАК ОчищатьОтветВЛоге
	|ИЗ
	|	втМетоды КАК втМетоды
	|ГДЕ
	|	втМетоды.HTTPМетод = &HTTPМетод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втМетоды.Шаблон,
	|	втМетоды.HTTPМетод,
	|	втМетоды.СпособЛогирования,
	|	втМетоды.ОчищатьОтветВЛоге
	|ИЗ
	|	втМетоды КАК втМетоды
	|ГДЕ
	|	втМетоды.HTTPМетод = ЗНАЧЕНИЕ(Перечисление.кв_HTTPМетоды.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Сервис", Сервис);
	Запрос.УстановитьПараметр("НаименованиеШаблона", СокрЛП(НаименованиеШаблона));
	Запрос.УстановитьПараметр("HTTPМетод", HTTPМетод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Восстанавливает корректное имя шаблона сервиса из данных запроса:
// в переданном относительном пути запроса значения параметров заменяются на имена.
//
// Параметры:
//  ОтносительныйURL - Строка - относительный путь.
//  ПараметрыURL     - ФиксированноеСоответствие - параметры, переданные в url запроса.
// 
// Возвращаемое значение:
//  Строка.
//
Функция ВосстановитьИмяШаблонаПоПараметрам(Знач ОтносительныйURL, ПараметрыURL) Экспорт
	
	Результат = НРег(СокрЛП(ОтносительныйURL));
	
	Если ПустаяСтрока(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	СимволРазделителяПараметров = кв_ОбщегоНазначенияКлиентСервер.СимволРазделителяПараметровСтрокиURL();
	
	СимволПроизвольногоПараметра = "*";
	ЕстьПроизвольныйПараметр = Ложь;
	
	Если ПараметрыURL.Количество() > 0 Тогда
		
		ПараметрыРезультата = кв_ОбщегоНазначенияКлиентСервер.ЧастиСтрокиURL(Результат);
		
		Для Каждого ПараметрURL Из ПараметрыURL Цикл
			
			ЭтоПроизвольныйПараметр = (ПараметрURL.Ключ = СимволПроизвольногоПараметра);
			
			Если ЭтоПроизвольныйПараметр Тогда
				ЕстьПроизвольныйПараметр = Истина;
			КонецЕсли;
			
			КонечныеПараметры = кв_ОбщегоНазначенияКлиентСервер.ЧастиСтрокиURL(НРег(ПараметрURL.Значение));
			
			Для Каждого КонечныйПараметр Из КонечныеПараметры Цикл
				
				ИндексПараметраРезультата = ПараметрыРезультата.Найти(КонечныйПараметр);
				
				Если ИндексПараметраРезультата <> Неопределено Тогда
					
					Если ЭтоПроизвольныйПараметр Тогда
						ПараметрыРезультата.Удалить(ИндексПараметраРезультата);
					Иначе
						ПараметрыРезультата[ИндексПараметраРезультата] = СтрШаблон("{%1}", Нрег(ПараметрURL.Ключ));
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Результат = СтрШаблон("%1%2",
			СимволРазделителяПараметров,
			СтрСоединить(ПараметрыРезультата, СимволРазделителяПараметров));
		
	КонецЕсли;
	
	Если ЕстьПроизвольныйПараметр Тогда
		Результат = СтрШаблон("%1%2%3",
			Результат,
			СимволРазделителяПараметров,
			СимволПроизвольногоПараметра);
	КонецЕсли;
	
	кв_ОбщегоНазначенияКлиентСервер.ОтформатироватьНаименованиеШаблонаСервиса(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ШаблоныПоСервисуИзСправочника(ПараметрыСервиса)
	
	Если Не ЗначениеЗаполнено(ПараметрыСервиса.Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	кв_ШаблоныСервисов.Ссылка КАК Ссылка,
	|	кв_ШаблоныСервисов.Наименование КАК Наименование,
	|	ЕСТЬNULL(кв_ШаблоныСервисовМетоды.HTTPМетод, ЗНАЧЕНИЕ(Перечисление.кв_HTTPМетоды.ПустаяСсылка)) КАК HTTPМетод
	|ИЗ
	|	Справочник.кв_ШаблоныСервисов КАК кв_ШаблоныСервисов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.кв_ШаблоныСервисов.Методы КАК кв_ШаблоныСервисовМетоды
	|		ПО (кв_ШаблоныСервисовМетоды.Ссылка = кв_ШаблоныСервисов.Ссылка)
	|ГДЕ
	|	НЕ кв_ШаблоныСервисов.ПометкаУдаления
	|	И кв_ШаблоныСервисов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", ПараметрыСервиса.Ссылка);
	
	Шаблоны = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаШаблона Из Шаблоны Цикл
		кв_ОбщегоНазначенияКлиентСервер.ОтформатироватьНаименованиеШаблонаСервиса(СтрокаШаблона.Наименование);
	КонецЦикла;
	
	Возврат Шаблоны;
	
КонецФункции

Функция ШаблоныПоСервисуИзМетаданных(ПараметрыСервиса)
	
	Шаблоны = Новый Соответствие;
	
	Если Не ЗначениеЗаполнено(ПараметрыСервиса.Наименование) Тогда
		Возврат Шаблоны;
	КонецЕсли;
	
	СервисМетаданные = Неопределено;
	
	Для Каждого Сервис Из Метаданные.HTTPСервисы Цикл
		Если Сервис.КорневойURL = ПараметрыСервиса.Наименование Тогда
			СервисМетаданные = Сервис;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СервисМетаданные = Неопределено Тогда
		Возврат Шаблоны;
	КонецЕсли;
	
	ПустойHTTPМетод = Перечисления.кв_HTTPМетоды.ПустаяСсылка();
	
	Для Каждого ШаблонМетаданные Из СервисМетаданные.ШаблоныURL Цикл
		
		НаименованиеШаблона = ШаблонМетаданные.Шаблон;
		кв_ОбщегоНазначенияКлиентСервер.ОтформатироватьНаименованиеШаблонаСервиса(НаименованиеШаблона);
		
		Если Не ЗначениеЗаполнено(НаименованиеШаблона) Тогда
			Продолжить;
		КонецЕсли;
		
		Методы = Новый Массив;
		
		Для Каждого Метод Из ШаблонМетаданные.Методы Цикл
			
			HTTPМетод = кв_ОбщегоНазначения.НайтиЗначениеПеречисления("кв_HTTPМетоды", Строка(Метод.HTTPМетод));
			
			Если Не ЗначениеЗаполнено(HTTPМетод) Тогда
				HTTPМетод = ПустойHTTPМетод;
			КонецЕсли;
			
			Методы.Добавить(HTTPМетод);
			
		КонецЦикла;
		
		Шаблоны.Вставить(НаименованиеШаблона, Методы);
		
	КонецЦикла;
	
	Возврат Шаблоны;
	
КонецФункции

#КонецОбласти

#КонецЕсли
